cjdell/esp32-nix/components/ESP32-audioI2S/src/Audio.cpp
    // adapted from:
    // https://github.com/espressif/esp-idf/tree/master/examples/peripherals/i2s/i2s_basic/i2s_pdm
    // source:
    // https://github.com/espressif/esp-idf/blob/master/examples/peripherals/i2s/i2s_basic/i2s_pdm/main/i2s_pdm_tx.c
    // could https://github.com/espressif/esp-idf/tree/master/examples/peripherals/dac/dac_continuous/dac_audio
    // be the right start to bring esp32 internal dac support to IDF version 5?

    //only in newer idf?
    //m_i2s_pdm_tx_cfg.slot_cfg = I2S_PDM_TX_SLOT_DAC_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO);
    m_i2s_pdm_tx_cfg.slot_cfg.data_bit_width = I2S_DATA_BIT_WIDTH_16BIT;
    m_i2s_pdm_tx_cfg.slot_cfg.slot_bit_width = I2S_SLOT_BIT_WIDTH_AUTO;
    m_i2s_pdm_tx_cfg.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;// or I2S_SLOT_MODE_MONO;
#if SOC_I2S_HW_VERSION_1
    // one of I2S_PDM_SLOT_RIGHT, I2S_PDM_SLOT_LEFT, I2S_PDM_SLOT_BOTH
    m_i2s_pdm_tx_cfg.slot_cfg.slot_mask = I2S_PDM_SLOT_RIGHT;
#warning "SOC_I2S_HW_VERSION_1"
#endif
    m_i2s_pdm_tx_cfg.slot_cfg.sd_prescale = 0;
    // possible filter settings
    // I2S_PDM_SIG_SCALING_DIV_2 = 0,   /*!< I2S TX PDM signal scaling: /2 */
    // I2S_PDM_SIG_SCALING_MUL_1 = 1,   /*!< I2S TX PDM signal scaling: x1 */
    // I2S_PDM_SIG_SCALING_MUL_2 = 2,   /*!< I2S TX PDM signal scaling: x2 */
    // I2S_PDM_SIG_SCALING_MUL_4 = 3,   /*!< I2S TX PDM signal scaling: x4 */
    m_i2s_pdm_tx_cfg.slot_cfg.sd_scale = I2S_PDM_SIG_SCALING_MUL_1;
    m_i2s_pdm_tx_cfg.slot_cfg.hp_scale = I2S_PDM_SIG_SCALING_MUL_1;
    m_i2s_pdm_tx_cfg.slot_cfg.lp_scale = I2S_PDM_SIG_SCALING_MUL_4;
    m_i2s_pdm_tx_cfg.slot_cfg.sinc_scale = I2S_PDM_SIG_SCALING_MUL_4;
#if SOC_I2S_HW_VERSION_2
    //SOC_I2S_HW_VERSION_2 esp32-s3 onwards? (idf > 5.1beta ?)
    m_i2s_pdm_tx_cfg.slot_cfg.line_mode = I2S_PDM_TX_TWO_LINE_DAC; // or I2S_PDM_TX_ONE_LINE_DAC; for mono
    m_i2s_pdm_tx_cfg.slot_cfg.hp_en = true;
    m_i2s_pdm_tx_cfg.slot_cfg.hp_cut_off_freq_hz = 35.5;
    m_i2s_pdm_tx_cfg.slot_cfg.sd_dither = 0;
    m_i2s_pdm_tx_cfg.slot_cfg.sd_dither2 = 1;
    m_i2s_pdm_tx_cfg.gpio_cfg.dout2 = I2S_GPIO_UNUSED;// Assignment in setPinout()
#warning "SOC_I2S_HW_VERSION_2"
#endif
    m_i2s_pdm_tx_cfg.gpio_cfg.clk = I2S_GPIO_UNUSED;
    m_i2s_pdm_tx_cfg.gpio_cfg.dout = I2S_GPIO_UNUSED;// Assignment in setPinout()
    m_i2s_pdm_tx_cfg.gpio_cfg.invert_flags.clk_inv = false;
    //only in newer idf?
    //m_i2s_pdm_tx_cfg.clk_cfg = I2S_PDM_TX_CLK_DAC_DEFAULT_CONFIG(44100);
    m_i2s_pdm_tx_cfg.clk_cfg.sample_rate_hz = 44100;
    m_i2s_pdm_tx_cfg.clk_cfg.clk_src = I2S_CLK_SRC_DEFAULT; //I2S_CLK_SRC_APLL
    m_i2s_pdm_tx_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_128;//I2S_MCLK_MULTIPLE_256;
    m_i2s_pdm_tx_cfg.clk_cfg.up_sample_fp = 960;
    m_i2s_pdm_tx_cfg.clk_cfg.up_sample_fs = (44100) / 100;
    // SOC_I2S_HW_VERSION_2 esp32-s3 onwards? (idf > 5.1beta ?)
    //m_i2s_pdm_tx_cfg.clk_cfg.bclk_div = 13;
    ESP_ERROR_CHECK(i2s_channel_init_pdm_tx_mode(m_i2s_tx_handle, &m_i2s_pdm_tx_cfg));

    I2Sstart(m_i2s_num);
    m_sampleRate = 44100;

    if (internalDAC)  {
        #ifdef CONFIG_IDF_TARGET_ESP32  // ESP32S3 has no DAC
        printf("internal DAC is not supported");
         // no support in V5 ???
        #endif
    }
#else
    m_i2s_config.sample_rate          = 44100;
    m_i2s_config.bits_per_sample      = I2S_BITS_PER_SAMPLE_16BIT;
    m_i2s_config.channel_format       = I2S_CHANNEL_FMT_RIGHT_LEFT;
    m_i2s_config.intr_alloc_flags     = ESP_INTR_FLAG_LEVEL1; // interrupt priority
    m_i2s_config.dma_buf_count        = 16;
    m_i2s_config.dma_buf_len          = 512;
    m_i2s_config.use_apll             = APLL_DISABLE;
    m_i2s_config.tx_desc_auto_clear   = true;
    m_i2s_config.fixed_mclk           = true;
    m_i2s_config.mclk_multiple        = I2S_MCLK_MULTIPLE_128;

    if (internalDAC)  {
        #ifdef CONFIG_IDF_TARGET_ESP32  // ESP32S3 has no DAC
        printf("internal DAC");
        m_i2s_config.mode             = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN );
        m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_MSB); // vers >= 2.0.5
        i2s_driver_install((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
        i2s_set_dac_mode((i2s_dac_mode_t)m_f_channelEnabled);
        if(m_f_channelEnabled != I2S_DAC_CHANNEL_BOTH_EN) {
            m_f_forceMono = true;
        }
        #endif
    }
    else {
        m_i2s_config.mode             = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);
        m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // Arduino vers. > 2.0.0
        i2s_driver_install((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
        m_f_forceMono = false;
    }
    i2s_zero_dma_buffer((i2s_port_t) m_i2s_num);

#endif // ESP_IDF_VERSION_MAJOR == 5
    for(int i = 0; i < 3; i++) {
        m_filter[i].a0 = 1;
        m_filter[i].a1 = 0;
        m_filter[i].a2 = 0;
        m_filter[i].b1 = 0;
        m_filter[i].b2 = 0;
    }
    computeLimit();  // first init, vol = 21, vol_steps = 21
    startAudioTask();
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Audio::~Audio() {
    // I2Sstop(m_i2s_num);
    // InBuff.~AudioBuffer(); #215 the AudioBuffer is automatically destroyed by the destructor
    setDefaults();
    if(m_playlistBuff) {
        free(m_playlistBuff);
        m_playlistBuff = NULL;
    }
#if ESP_IDF_VERSION_MAJOR == 5
    i2s_channel_disable(m_i2s_tx_handle);
    i2s_del_channel(m_i2s_tx_handle);
#else
    i2s_driver_uninstall((i2s_port_t)m_i2s_num); // #215 free I2S buffer
#endif
    if(m_chbuf)       {free(m_chbuf);        m_chbuf        = NULL;}
    if(m_lastHost)    {free(m_lastHost);     m_lastHost     = NULL;}
    if(m_outBuff)     {free(m_outBuff);      m_outBuff      = NULL; }
    if(m_ibuff)       {free(m_ibuff);        m_ibuff        = NULL;}
    if(m_lastM3U8host){free(m_lastM3U8host); m_lastM3U8host = NULL;}

    stopAudioTask();
    vSemaphoreDelete(mutex_playAudioData);
}
// clang-format on
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Audio::setBufsize(int rambuf_sz, int psrambuf_sz) {
    if(InBuff.isInitialized()) {
        log_e("Audio::setBufsize must not be called after audio is initialized");
        return;
    }
    InBuff.setBufsize(rambuf_sz, psrambuf_sz);
};

